Renesas-US-Connectivity/ra6m4_mcuboot_ble_dsps/MCUboot_Encryption_Initial_Projects/app_ra6m4_primary_enc_dsps_ota/ra_gen/dsps_downloader_thread.h
/* generated thread header file - do not edit */
#ifndef DSPS_DOWNLOADER_THREAD_H_
#define DSPS_DOWNLOADER_THREAD_H_
#include "bsp_api.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "hal_data.h"
#ifdef __cplusplus
                extern "C" void dsps_downloader_thread_entry(void * pvParameters);
                #else
extern void dsps_downloader_thread_entry(void *pvParameters);
#endif
#include "r_flash_hp.h"
#include "r_flash_api.h"
#include "r_sci_uart.h"
#include "r_uart_api.h"
FSP_HEADER
/* Flash on Flash HP Instance */
extern const flash_instance_t g_flash0;

/** Access the Flash HP instance using these structures when calling API functions directly (::p_api is not used). */
extern flash_hp_instance_ctrl_t g_flash0_ctrl;
extern const flash_cfg_t g_flash0_cfg;

#ifndef NULL
void NULL(flash_callback_args_t *p_args);
#endif
/** UART on SCI Instance. */
extern const uart_instance_t g_uart0;

/** Access the UART instance using these structures when calling API functions directly (::p_api is not used). */
extern sci_uart_instance_ctrl_t g_uart0_ctrl;
extern const uart_cfg_t g_uart0_cfg;
extern const sci_uart_extended_cfg_t g_uart0_cfg_extend;

#ifndef uart_cb_empty
void uart_cb_empty(uart_callback_args_t *p_args);
#endif
FSP_FOOTER
#endif /* DSPS_DOWNLOADER_THREAD_H_ */
